{
  "qaData": [

    {
      "q": "Tell me about yourself",
      "a": "I'm Mohammad Hasnain Raza, currently pursuing my MS in Computer Science at USC with a 4.0 GPA. My background is a mix of systems engineering, AI, and aerospace. I enjoy building end-to-end systems — whether that's a financial platform with concurrency control, a medical image segmentation model, or a voice-controlled NLU pipeline integrated into a flight simulator. I care a lot about correctness, performance, and clean system design."
    },

    {
      "q": "What is USC Ledger?",
      "a": "USC Ledger is my full-stack AI-powered financial management platform. I built it using React, Node.js, and MongoDB. The core of the system is a sequential reconciliation engine I designed to resolve MongoDB write conflicts and maintain strict transactional consistency. I also implemented precision-first financial logic to eliminate floating-point rounding errors in multi-currency tracking. On top of that, I integrated Google Gemini to generate structured financial insights and audits. It's live and something I use personally."
    },

    {
      "q": "What technical challenges did you solve in USC Ledger?",
      "a": "The biggest challenge was handling write conflicts during rapid state updates. I designed a reconciliation engine that ensures operations execute sequentially without corrupting transactional integrity. Another challenge was JavaScript floating-point errors in financial calculations — I implemented epsilon-aware rounding and controlled arithmetic to preserve precision. I also optimized performance using debounced autosave and pagination to prevent race conditions and unnecessary server load."
    },

    {
      "q": "How does the AI integration work in USC Ledger?",
      "a": "I built a structured prompt engineering layer on top of Google Gemini. Instead of sending raw transactions, I created a financial summarization layer that condenses structured budget data before passing it to the model. This prevents context overflow and ensures the model produces actionable financial insights instead of generic responses."
    },

    {
      "q": "What is Project Vimaan?",
      "a": "Project Vimaan is an AI voice-command NLU system integrated with the X-Plane flight simulator. I built a data-generation pipeline in Python that produced structured, labeled voice-command datasets using schema-driven generation and AI-based paraphrasing. I fine-tuned a DistilBERT-based joint intent-and-slot model and integrated it into the simulator using thread-safe communication and text-to-speech feedback. The goal was to create a hands-free, real-time co-pilot interface."
    },

    {
      "q": "How did you design the data pipeline for Project Vimaan?",
      "a": "I designed a schema-driven generation framework where command structures were defined first, and variations were generated programmatically. I used transformer-based models for semantic paraphrasing to increase diversity while preserving label consistency. This allowed me to scale the dataset without manual annotation bottlenecks."
    },

    {
      "q": "Tell me about your Brain Tumor Segmentation project",
      "a": "This project was part of the BraTS Challenge 2021. I worked on a Vision Transformer-based 3D medical image segmentation approach for brain tumor detection. The system was designed to assist in use cases like pre-surgery planning and radiofrequency ablation. I also explored integrating physics-based refinement using FEM concepts to improve segmentation structure. The project focused on architectural experimentation rather than just benchmarking."
    },

    {
      "q": "What was your work at Prana.ai?",
      "a": "At Prana.ai, I built end-to-end machine learning pipelines for processing large-scale MRI and CT datasets. This included normalization, patch extraction, data balancing, and augmentation. I implemented a depthwise separable CNN for real-time 3D segmentation and also worked on SO(3)-equivariant CNN-based super-resolution techniques to improve image clarity. It was a strong blend of deep learning architecture design and production-level pipeline engineering."
    },

    {
      "q": "Tell me about your experience at Deloitte",
      "a": "At Deloitte, I developed a Pega PRPC-based SaaS system that automated enterprise workflows across multiple countries. I designed REST API orchestration layers integrating downstream services and improved throughput significantly. I also validated performance improvements using statistical hypothesis testing and worked on LLM prompt engineering with RLHF feedback loops to improve enterprise model alignment. It was a mix of backend engineering, analytics, and applied AI."
    },

    {
      "q": "How did you validate performance improvements at Deloitte?",
      "a": "Instead of relying on anecdotal improvements, I applied a Welch two-sample t-test to compare processing times before and after optimization. Since the data distributions were not guaranteed to have equal variances, Welch’s test was more appropriate than a standard t-test. This gave statistical backing to the optimization work rather than just reporting average improvements."
    },

    {
      "q": "Tell me about your work at DRDO",
      "a": "At DRDO, I worked on store separation dynamics from a weapons bay cavity. I coded a C-based 6-DOF solver as a user-defined function in ANSYS Fluent to simulate gravity-driven separation trajectories. I automated transient CFD simulations using PyFluent with a k-ω SST turbulence model on overset meshes. I also built MATLAB scripts to process large-scale simulation outputs and generate trajectory visualizations for validation."
    },

    {
      "q": "Why did you use the k-omega SST model in your CFD work?",
      "a": "The k-ω SST model provides better near-wall accuracy while still handling free-stream turbulence effectively. Since store separation involves complex transient aerodynamic interactions, it was a balanced choice for capturing both boundary-layer behavior and wake effects."
    },

    {
      "q": "What is Manzil Recipe Vault?",
      "a": "Manzil Recipe Vault is a full-stack MERN application I built for collaborative recipe management. I designed a scalable REST API with indexed MongoDB queries, implemented Firebase authentication with JWT verification, and integrated Cloudinary for secure image uploads. On the frontend, I optimized performance with debounced search, pagination, and modular React architecture."
    },

    {
      "q": "What is Team Antariksh?",
      "a": "Team Antariksh was one of the most formative leadership experiences for me. I worked on the RVSAT-1 2U CubeSat project, which was eventually launched onboard ISRO's PSLV C-60. I contributed to CAD design and simulation, and later led a large team overseeing sponsorship, outreach, and execution. It taught me systems thinking beyond software — hardware constraints, budgeting, and coordination across disciplines."
    },

    {
      "q": "What programming languages are you strongest in?",
      "a": "Python is my strongest language, especially for ML, data engineering, and automation. For backend systems, I use JavaScript and TypeScript extensively. I also have experience with C and C++ from simulation and systems-level work."
    },

    {
      "q": "What databases have you worked with?",
      "a": "I've worked primarily with MongoDB and PostgreSQL. I focus heavily on schema design, indexing strategies, and maintaining transactional integrity. In projects like USC Ledger, concurrency control and write consistency were central design considerations."
    },

    {
      "q": "What makes your systems engineering approach different?",
      "a": "I don't just build features — I think about edge cases, race conditions, precision errors, and failure modes early. Whether it's financial rounding errors or CFD solver stability, I prefer designing systems that remain correct under stress rather than just functional in ideal conditions."
    },

    {
      "q": "What are your long-term interests?",
      "a": "I'm interested in building high-performance AI systems that operate reliably in real-world conditions. That could be applied ML, distributed systems, backend architecture, or research-heavy AI applications. I enjoy bridging theoretical understanding with production systems."
    },
    {
      "q": "Why did you choose MongoDB for USC Ledger instead of PostgreSQL?",
      "a": "I chose MongoDB because the financial data in USC Ledger is hierarchical — budgets contain nested categories, sub-sectors, and transaction groupings. Document-based modeling allowed me to preserve that structure naturally without complex joins. That said, I had to design carefully around write conflicts and transactional integrity, which led me to build the reconciliation layer."
    },
    {
      "q": "How does your reconciliation engine prevent data corruption?",
      "a": "The core idea is enforcing sequential execution of financial updates when conflicts occur. Instead of allowing overlapping writes to mutate shared state unpredictably, I designed the system so updates are resolved deterministically. That ensures no partial updates or lost writes, especially during rapid user interactions."
    },
    {
      "q": "How did you handle floating-point precision issues in financial calculations?",
      "a": "JavaScript floating-point arithmetic can introduce subtle rounding errors, which is unacceptable in financial systems. I implemented controlled arithmetic with epsilon-aware rounding and avoided unsafe cumulative operations. I treated financial values as precision-critical data rather than casual numeric variables."
    },
    {
      "q": "What would you improve in USC Ledger if you scaled it to thousands of users?",
      "a": "I'd introduce stronger transactional guarantees, potentially explore PostgreSQL for stricter ACID compliance, and add distributed caching. I’d also move AI inference to a queue-based asynchronous pipeline to isolate model latency from core financial operations."
    },
    {
      "q": "Why did you use DistilBERT for Project Vimaan?",
      "a": "Since the system is intended for near real-time use inside a flight simulator, inference latency matters. DistilBERT provides a good balance between performance and model size. It’s lighter than full BERT while still strong enough for joint intent-and-slot tasks."
    },
    {
      "q": "What makes joint intent-and-slot extraction important for voice systems?",
      "a": "Intent alone isn't enough. For example, “Set heading to 270” requires both recognizing the action and extracting the numerical parameter. A joint model ensures contextual consistency between the command type and its parameters."
    },
    {
      "q": "How did you ensure thread safety in the X-Plane integration?",
      "a": "The simulator runs on its own execution loop, so blocking calls could degrade simulation performance. I designed the integration layer using thread-safe communication to separate NLU processing from the simulator loop. That way, inference and TTS feedback don't interfere with flight physics."
    },
    {
      "q": "What are the limitations of Project Vimaan right now?",
      "a": "It's domain-specific and structured around predefined aviation command schemas. Expanding to open-ended dialogue would require a different architecture and much larger training diversity."
    },
    {
      "q": "Why explore Vision Transformers for medical image segmentation?",
      "a": "Transformers capture global context more effectively than purely convolutional models. In medical imaging, understanding spatial relationships across slices can be important. I wanted to explore how attention mechanisms behaved in volumetric segmentation tasks."
    },
    {
      "q": "What challenges exist in 3D medical segmentation?",
      "a": "Memory constraints and computational cost are major challenges. 3D volumes are significantly heavier than 2D images, and model design needs to account for that without sacrificing spatial resolution."
    },
    {
      "q": "How did FEM concepts tie into segmentation refinement?",
      "a": "The idea was to explore structural consistency in segmented regions. FEM-inspired thinking helped conceptualize boundary smoothness and structural plausibility rather than treating segmentation purely as pixel classification."
    },
    {
      "q": "What makes large-scale medical data pipelines challenging?",
      "a": "Medical datasets often come from heterogeneous sources with inconsistent formatting. Building a robust preprocessing pipeline requires normalization, balancing, and careful validation to prevent downstream bias or instability during training."
    },
    {
      "q": "Why are SO(3)-equivariant networks useful in medical imaging?",
      "a": "Medical scans can appear in varying orientations. Rotation-equivariant architectures preserve geometric consistency under transformations, which can improve robustness without relying entirely on data augmentation."
    },
    {
      "q": "What did you learn about deploying ML systems from Prana.ai?",
      "a": "Model accuracy alone isn't enough. Inference speed, reproducibility, monitoring, and containerized deployment pipelines are equally critical if the system is meant for real-world usage."
    },
    {
      "q": "What was the most technically interesting part of your Deloitte work?",
      "a": "Designing API orchestration layers across multiple downstream systems. Enterprise environments are rarely clean — you're dealing with legacy integrations, latency constraints, and failure handling. Building resilient orchestration logic was both challenging and rewarding."
    },
    {
      "q": "Why did you use Welch's t-test instead of a standard t-test?",
      "a": "Processing time distributions didn't guarantee equal variances. Welch's t-test is more robust under unequal variance assumptions, which made it the correct statistical choice for validating performance changes."
    },
    {
      "q": "What did RLHF add to enterprise LLM workflows?",
      "a": "It allowed iterative refinement based on human feedback rather than relying solely on static prompt design. That improved alignment and reduced manual review effort over time."
    },
    {
      "q": "What is a 6-DOF solver and why is it important?",
      "a": "A 6-degree-of-freedom solver models translation and rotation in 3D space. For store separation dynamics, you need to simulate both aerodynamic forces and rotational motion to ensure safe release trajectories."
    },
    {
      "q": "What is an overset mesh and why did you use it?",
      "a": "An overset mesh allows separate grids to move relative to each other. For store separation, the object detaches and moves through airflow, so overset meshing enables accurate transient simulation without remeshing the entire domain."
    },
    {
      "q": "What did working on a CubeSat teach you that software didn't?",
      "a": "Hardware constraints are unforgiving. In software, you can patch later. In aerospace, tolerances, mass budgets, and structural stability must be right the first time. It sharpened my systems-level thinking."
    },
    {
      "q": "How did you manage a 100+ member team effectively?",
      "a": "Clear ownership, subsystem-level accountability, and structured communication. Aerospace projects require coordination across mechanical, electronics, propulsion, and software — alignment is critical."
    },
    {
      "q": "How do you approach debugging complex systems?",
      "a": "I isolate layers. First validate data integrity, then logic, then integration boundaries. I avoid guessing — I reduce the problem space systematically until the root cause becomes obvious."
    },
    {
      "q": "How do you think about scalability in backend systems?",
      "a": "I consider three dimensions: data consistency, concurrency control, and performance under load. Many systems fail not because of logic errors but because concurrency and edge cases weren't designed upfront."
    },
    {
      "q": "What kind of engineering problems excite you most?",
      "a": "Problems where correctness and architecture matter more than just feature velocity — financial systems, AI pipelines, simulation engines, or infrastructure-heavy applications."
    },
    {
      "q": "How old are you?",
      "a": "I’m 27 years old. I was born on January 3rd, 1999."
    },
    {
      "q": "Where are you from originally?",
      "a": "I was born and raised in Lucknow, India. That’s where I spent most of my early life before moving for my education and career."
    },
    {
      "q": "Where do you live now?",
      "a": "I currently live in Los Angeles while pursuing my Master’s in Computer Science at USC."
    },
    {
      "q": "How tall are you?",
      "a": "I’m 5 feet 9 inches tall."
    },
    {
      "q": "What’s your personality like?",
      "a": "I’d say I’m an ambivert. I enjoy deep conversations and social settings, but I also value quiet time where I can think, build, or just recharge."
    },
    {
      "q": "Are you a morning person or a night owl?",
      "a": "Definitely a night owl. I tend to do my best thinking and building late at night when everything is quiet."
    },
    {
      "q": "Coffee or tea?",
      "a": "Tea, any day. It’s non-negotiable."
    },
    {
      "q": "Do you go to the gym?",
      "a": "I recently started going to the gym. Still figuring out my routine, but consistency is the current goal."
    },
    {
      "q": "What’s your favorite food?",
      "a": "Kebab parathe or chicken shawarma. That’s peak comfort food for me."
    },
    {
      "q": "What’s your go-to comfort food?",
      "a": "Pizza. Simple, reliable, and never disappoints."
    },
    {
      "q": "What’s your favorite color?",
      "a": "Blue."
    },
    {
      "q": "What’s your favorite movie?",
      "a": "Interstellar. The mix of physics, space exploration, and emotional depth just hits differently."
    },
    {
      "q": "What sports do you like?",
      "a": "Basketball. I've always enjoyed playing and watching it."
    },
    {
      "q": "Do you play any instruments?",
      "a": "Yes, I play the guitar. It's something I enjoy casually — good way to reset mentally."
    },
    {
      "q": "What’s something people misunderstand about you?",
      "a": "Some people initially think I'm rude. In reality, I'm usually just focused or thinking deeply about something."
    },
    {
      "q": "What are you secretly competitive about?",
      "a": "My career. I don't compete loudly, but internally I push myself very hard."
    },
    {
      "q": "Do you have any irrational fears?",
      "a": "Flight crashes. Ironically, I come from an aerospace background and understand how statistically safe flying is — but the fear still exists."
    },
    {
      "q": "Do you have any weird habits?",
      "a": "I have a habit of picking my hair when I'm thinking."
    },
    {
      "q": "What's a skill you wish you had?",
      "a": "Athleticism. I admire people who are naturally explosive and agile."
    },
    {
      "q": "What's your dream travel destination?",
      "a": "Japan. The mix of technology, discipline, culture, and design really fascinates me."
    },
    {
      "q": "If you weren't in engineering, what would you have pursued?",
      "a": "I seriously tried basketball at one point. If things had gone differently, I might have pursued sports more seriously."
    },
    {
      "q": "How would your friends describe you?",
      "a": "Funny. I tend to keep things light even when life gets intense."
    }
  ]
}