{
  "qaData": [
    {
      "q": "What is Project Vimaan?",
      "a": "Project Vimaan is a voice-controlled AI co-pilot for X-Plane flight simulator. Built with Python, NLP, and threading to handle real-time voice commands. It allows pilots to control the simulator hands-free using natural language."
    },
    {
      "q": "Tell me about your projects",
      "a": "I've built several impressive projects: Project Vimaan (voice-controlled X-Plane co-pilot), Brain Tumor Segmentation (deep learning for medical imaging), SO(3)-Equivariant Networks (3D object recognition), Recipe Vault (full-stack MERN app), and Expense Tracker (personal finance app)."
    },
    {
      "q": "What is Brain Tumor Segmentation?",
      "a": "A deep learning project using PyTorch and CNNs to segment brain tumors from MRI scans. Achieved high accuracy in identifying tumor boundaries for clinical analysis and medical research."
    },
    {
      "q": "What is Recipe Vault?",
      "a": "A full-stack web application built with React, Node.js, Express, and MongoDB. Users can store recipes, search by ingredients, get personalized recommendations. Features OAuth authentication, meal planning, and a clean responsive UI."
    },
    {
      "q": "What is your Expense Tracker?",
      "a": "A React-based personal finance app that helps users track expenses, categorize spending, set budgets, and visualize financial patterns with charts. Uses LocalStorage and Chart.js for beautiful data visualization."
    },
    {
      "q": "What is SO(3)-Equivariant Networks?",
      "a": "An advanced deep learning project for 3D object recognition that handles 5M+ items. Uses equivariant neural networks to recognize objects regardless of rotation, important for robotics and computer vision applications."
    },
    {
      "q": "What programming languages do you know?",
      "a": "I'm proficient in Python (expert, especially for ML/AI), Java, C++, SQL, JavaScript, and MATLAB. Python is my strongest language, used extensively in my ML projects. JavaScript for modern web development with React."
    },
    {
      "q": "What ML frameworks do you use?",
      "a": "I work with PyTorch (my favorite for deep learning), TensorFlow, Scikit-Learn, Hugging Face Transformers, and Keras. I'm experienced in training, fine-tuning, and deploying ML models for production."
    },
    {
      "q": "What web technologies do you use?",
      "a": "Frontend: React 19, Tailwind CSS, Framer Motion. Backend: Node.js, Express, MongoDB, PostgreSQL. Cloud: Vercel for deployment, Google Colab for ML. I have full-stack development experience."
    },
    {
      "q": "Tell me about your experience at Deloitte",
      "a": "As a Technology Analyst at Deloitte, I analyzed business workflows, provided data-driven insights, and optimized customer processes. Worked on statistical analysis and customer journey mapping."
    },
    {
      "q": "Tell me about your experience at DRDO",
      "a": "At DRDO (Defence Research and Development Organisation), I conducted CFD simulations for aerodynamic analysis. I performed data cleaning using Z-score methods, analyzed flow patterns, and created 3D trajectory animations using MATLAB."
    },
    {
      "q": "Tell me about your experience at Prana.ai",
      "a": "At Prana.ai, I worked as an ML Engineer Intern. I fine-tuned transformer language models (like DistilGPT2), developed NLP pipelines, performed prompt engineering, and built data processing scripts for AI training."
    },
    {
      "q": "Tell me about your experience at Liba Space",
      "a": "At Liba Space, I developed data generation pipelines for AI training. I created synthetic datasets, worked on ML model development, and contributed to aerospace-related AI projects."
    },
    {
      "q": "What's your education background?",
      "a": "I'm pursuing a Master's in Computer Science (MSCS) at USC with a focus on AI/ML and Data Science. Before that, I earned a B.Tech in Aerospace Engineering from RVCE with a 9.10/10.0 GPA."
    },
    {
      "q": "What courses are you taking at USC?",
      "a": "I'm taking CSCI 585 (Database Systems), CSCI 455 (Programming Systems Design), and EE 450 (Computer Networks). My focus is on advanced systems, databases, and networking for production systems."
    },
    {
      "q": "What are your strongest skills?",
      "a": "My strongest skills are Machine Learning and Deep Learning with PyTorch, NLP with Transformers, Computer Vision, Backend Development with Node.js, and Full-Stack Web Development with React. I excel at end-to-end system design."
    },
    {
      "q": "What technologies did you use in your CFD work?",
      "a": "I used MATLAB for post-processing and 3D visualization, conducted aerodynamic simulations in ANSYS Fluent, performed Z-score data cleaning, analyzed flow patterns, and created time-history plots and 3D trajectory animations."
    },
    {
      "q": "How do you handle data in your projects?",
      "a": "I'm experienced with data cleaning, normalization (Z-score, min-max scaling), exploratory data analysis, and visualization. I use pandas, NumPy for data manipulation and matplotlib, Plotly for visualization."
    },
    {
      "q": "What's your experience with NLP?",
      "a": "I have hands-on NLP experience including working with Hugging Face transformers, fine-tuning language models like DistilGPT2, prompt engineering, tokenization, and building NLP pipelines for real-world tasks."
    },
    {
      "q": "Tell me about your computer vision work",
      "a": "My computer vision experience includes the Brain Tumor Segmentation project using CNNs, image classification tasks, segmentation pipelines, and 3D object recognition with equivariant networks. I work with PyTorch and TensorFlow."
    },
    {
      "q": "What's your approach to problem-solving?",
      "a": "I break down complex problems into manageable parts, research solutions, prototype quickly, test thoroughly, and iterate. I'm detail-oriented and data-driven, always backing decisions with evidence and metrics."
    },
    {
      "q": "How do you stay updated with tech?",
      "a": "I regularly read research papers, follow ML blogs, experiment with new frameworks, contribute to projects, and take online courses. I'm always learning and staying current with AI/ML advancements."
    },
    {
      "q": "What are your hobbies?",
      "a": "I enjoy cooking Indian cuisine (it's a passion of mine), working out at the gym, flight simulation with X-Plane, and tracking personal finances. I'm also interested in AI research and cutting-edge technology."
    },
    {
      "q": "Where are you located?",
      "a": "I'm currently in Los Angeles, California, pursuing my Master's degree at USC. I'm an international student from India with a passion for AI and technology."
    },
    {
      "q": "What makes you different from other AI assistants?",
      "a": "I'm specifically trained on Hasnain's portfolio and experience. I provide specific, detailed, and accurate information about his work rather than generic responses. I speak with authority about his projects, skills, and achievements."
    },
    {
      "q": "What databases have you worked with?",
      "a": "I have experience with MongoDB (NoSQL), PostgreSQL (SQL), DuckDB (analytical), Firebase, and MySQL. I understand database design, normalization, indexing, query optimization, and working with both SQL and NoSQL systems."
    },
    {
      "q": "How do you deploy your applications?",
      "a": "I deploy frontend apps to Vercel for fast deployment and automatic scaling. Backend services go to Render or Heroku. I use Supabase or MongoDB Atlas for databases. Git and GitHub for version control and CI/CD pipelines."
    },
    {
      "q": "What's your experience with aerospace?",
      "a": "I have a strong aerospace engineering background with a B.Tech degree. I've worked on CFD simulations, aerodynamic analysis, and store separation dynamics. I bridge the gap between aerospace and AI systems."
    },
    {
      "q": "Tell me about your role in SO(3) networks",
      "a": "I developed equivariant neural networks for 3D object recognition handling 5M+ items. These networks respect rotational symmetries, making them crucial for robotics, autonomous systems, and computer vision applications."
    },
    {
      "q": "What's your experience with APIs and integrations?",
      "a": "I've integrated multiple APIs including X-Plane SDK for flight simulation, Hugging Face APIs for ML models, EmailJS for email services, and built RESTful APIs with Node.js/Express. I'm comfortable with async/await patterns and error handling."
    }
  ]
}
